nxp-mcuxpresso/mcux-sdk-examples/rdrw612bga/driver_examples/gpio/input_interrupt/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 0.16.10
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_io_mux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: FLEXCOMM3, signal: USART_RXD, pin_signal: GPIO_24}
  - {pin_num: E7, peripheral: GPIO, signal: 'PIO0, 25', pin_signal: GPIO_25, direction: INPUT, gpio_interrupt_a_enable: enabled, gpio_interrupt_config: gpioIrqFallingEdge}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Enables the clock for the GPIO0 module */
    GPIO_PortInit(GPIO, 0);

    gpio_pin_config_t gpio0_pinE7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    gpio_interrupt_config_t gpio0_pinE7_int_config = {
        .mode = kGPIO_PinIntEnableEdge,
        .polarity = kGPIO_PinIntEnableLowOrFall
    };
    /* Initialize GPIO functionality on pin PIO0_25 (pin E7)  */
    GPIO_PinInit(GPIO, 0U, 25U, &gpio0_pinE7_config);
    GPIO_SetPinInterruptConfig(GPIO, 0U, 25U, &gpio0_pinE7_int_config);
    GPIO_PinEnableInterrupt(GPIO, 0U, 25U, (uint32_t)kGPIO_InterruptA);
    /* Initialize FC3_USART_DATA functionality on pin GPIO_24 (pin E5) */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
    /* Initialize GPIO25 functionality on pin GPIO_25 (pin E7) */
    IO_MUX_SetPinMux(IO_MUX_GPIO25);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
